/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalpha.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kasingh <kasingh@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/11/07 09:59:52 by kasingh           #+#    #+#             */
/*   Updated: 2023/11/17 10:08:00 by kasingh          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ft_isalpha: Vérifie si un caractère est une lettre alphabétique */
int	ft_isalpha(int c)
{
	return ((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z'));
}
