/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kasingh <kasingh@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/11/07 11:54:16 by kasingh           #+#    #+#             */
/*   Updated: 2023/11/17 10:08:26 by kasingh          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ft_isascii: Vérifie si un caractère fait partie de la table ASCII */
int	ft_isascii(int c)
{
	return (c >= 0 && c <= 127);
}
